{

    "games": [

        {   
            "id": 0,
            "title": "Fortnite",
            "price": "0 - $30",
            "descripition": "Fortnite is a survival game where 100 players fight against each other in player versus player combat to be the last one standing. It is a fast-paced, action-packed game, not unlike The Hunger Games, where strategic thinking is a must in order to survive.",
            "popularity": "12.5 million",
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }


  
        {    "id": 1,
            "title": "Crossfire", 
            "price": "0 - $15",
            "descripition": "CrossFire is an online tactical first-person shooter game developed by Smilegate Entertainment for Microsoft Windows. It was first released in South Korea on May 3, 2007 " ,
            "popularity":"8 million" ,
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }


        {   
            "id": 2,
            "title": "Pokemon- Brilliant Diamond", 
            "price": "$59.99" ,
            "descripition": "Catch, train, and battle with your Pokémon on a journey to try to become the Pokémon League Champion!",
            "popularity": "6 million",
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }

        {   
            "id": 3,
            "title": "Roblox", 
            "price": "Free to download" ,
            "descripition": "Released in 2006, Roblox is an online game platform and game creation system developed by Roblox Corporation. It allows users to program games and play games created by other users." ,
            "popularity": "4 million",
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }

        {   
            "id": 4,
            "title": "Mine Craft", 
            "price": "can cost up to $20.00 depending on device." ,
            "descripition": "Minecraft is a 3-D computer game where players can build anything. The game which has been described as like an ‘online Lego’ involves building blocks and creating structures across different environments and terrains. Set in a virtual world the game involves resource gathering, crafting items, building, and combat." ,
            "popularity":"1.4 million" ,
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }

        {   
            "id": 5,
            "title": "Counter-strike", 
            "price": "$15 and up" ,
            "descripition": "Counter-Strike is a series of multiplayer first-person shooter video games in which teams of terrorists battle to perpetrate an act of terror while counter-terrorists try to prevent it. The series began on Windows in 1999 with the release of the first game, Counter-Strike." ,
            "popularity": "1.2 million",
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }


        {   
            "id": 6,
            "title": "New World", 
            "price": "$40",
            "descripition": "New World is a massively multiplayer online role-playing game developed by Amazon Games Orange County and published by Amazon Games released on September 28, 2021",
            "popularity": "913,634" ,
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }


        {   
            "id": 7,
            "title": "Dota 2", 
            "price": "free with In-app purchases",
            "descripition": "Dota 2 is a free-to-play multiplayer online battle arena (MOBA) where two teams of five players battle for control of their enemy’s base while trying to defend their own. Each playable character comes with a range of unique skills, which allows for strategic team composition and unexpected plays. There’s a high skill ceiling and a massive learning curve for anyone who hopes to get good." ,
            "popularity": "648,875" ,
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }


        {   
            "id": 8,
            "title": "PUBG", 
            "price": "free",
            "descripition": "PUBG is a player versus player shooter game in which up to one hundred players fight in a battle royale, a type of large-scale last man standing deathmatch.",
            "popularity":"458,778" ,
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }


        {   
            "id": 9,
            "title": "Apex Legend", 
            "price": "free with In-app purchases",
            "descripition": "Apex Legends is a free-to-play battle royale-hero shooter game developed by Respawn Entertainment and published by Electronic Arts. It was released for Microsoft Windows, PlayStation 4, and Xbox One in February 2019, and for Nintendo Switch in March 2021.",
            "popularity": "228,439" ,
            "image" : "",
            "comments" : [
                {
                    "text": "",
                    "ranks": ""
                }
            ]
        }
    ]


    }